FX_Cloud/src/test/source/0BOOTSTRAP.xml

<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
 <SOAP-ENV:Header>
  <cwmp:ID SOAP-ENV:mustUnderstand="1">2090</cwmp:ID>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <cwmp:Inform>
   <DeviceId>
    <Manufacturer>PHICOMM</Manufacturer>
    <OUI>000C43</OUI>
    <ProductClass>FIR300M</ProductClass>
    <SerialNumber>000C43762066</SerialNumber>
   </DeviceId>
   <Event SOAP-ENC:arrayType="cwmp:EventStruct[1]">
    <EventStruct>
     <EventCode>0 BOOTSTRAP</EventCode>
     <EventCode>4 VALUECHANGE</EventCode>
     <CommandKey></CommandKey>
    </EventStruct>
   </Event>
   <MaxEnvelopes>1</MaxEnvelopes>
   <CurrentTime>1970-1-1T0:3:3</CurrentTime>
   <RetryCount>0</RetryCount>
   <ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStruct[0017]">
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.DeviceSummary</Name>
     <Value xsi:type="xsd:string">InternetGatewayDevice:1.1[](Baseline:1, EthernetLAN:1, WiFiLAN:1, Time:1, IPPing:1, DeviceAssociation:1)</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.DeviceInfo.SpecVersion</Name>
     <Value xsi:type="xsd:string">1.0</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.DeviceInfo.HardwareVersion</Name>
     <Value xsi:type="xsd:string">1.0</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.DeviceInfo.SoftwareVersion</Name>
     <Value xsi:type="xsd:string">V1.0.14</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.DeviceInfo.ProvisioningCode</Name>
     <Value xsi:type="xsd:string"></Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestURL</Name>
     <Value xsi:type="xsd:string">http://172.16.157.40:30005</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.ManagementServer.ParameterKey</Name>
     <Value xsi:type="xsd:string"></Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.WANDevice.1.WANConnectionDevice.1.WANIPConnection.1.ExternalIPAddress</Name>
     <Value xsi:type="xsd:string">172.16.157.40</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.USERNAME</Name>
     <Value xsi:type="xsd:string">admin</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.PASSWORD</Name>
     <Value xsi:type="xsd:string">YWRtaW4=</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.CLOUD.MAILADDRESS</Name>
     <Value xsi:type="xsd:string">boke.xu@feixun.com.cn</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.CLOUD.PASSWORD</Name>
     <Value xsi:type="xsd:string">MTIzNDU2</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.CLOUD.USERNAME</Name>
     <Value xsi:type="xsd:string">ermao</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.CLOUD.MOBILE</Name>
     <Value xsi:type="xsd:string">15921762051</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.CLOUD.PROVINCE</Name>
     <Value xsi:type="xsd:string">100</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.CLOUD.ZIPCODE</Name>
     <Value xsi:type="xsd:string">202156</Value>
    </ParameterValueStruct>
    <ParameterValueStruct>
     <Name>InternetGatewayDevice.X_PHICOMM.ACTSTATUS</Name>
     <Value xsi:type="xsd:string">0</Value>
    </ParameterValueStruct>
   </ParameterList>
  </cwmp:Inform>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
